egov-workflow-v2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="egov-workflow-v2" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Transition Process" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Transition Process" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;RequestInfo&quot;: {&#xd;
    &quot;apiId&quot;: &quot;Rainmaker&quot;,&#xd;
    &quot;action&quot;: &quot;&quot;,&#xd;
    &quot;did&quot;: 1,&#xd;
    &quot;key&quot;: &quot;&quot;,&#xd;
    &quot;msgId&quot;: &quot;20170310130900|en_IN&quot;,&#xd;
    &quot;requesterId&quot;: &quot;&quot;,&#xd;
    &quot;ts&quot;: 1513579888683,&#xd;
    &quot;ver&quot;: &quot;.01&quot;,&#xd;
    &quot;userInfo&quot;: {&#xd;
      &quot;id&quot;: 28451,&#xd;
      &quot;uuid&quot;: &quot;ef5ace2d-a139-45b7-80bf-ce141df8ba5f&quot;,&#xd;
      &quot;userName&quot;: &quot;9408310077&quot;,&#xd;
      &quot;name&quot;: null,&#xd;
      &quot;mobileNumber&quot;: &quot;9408310077&quot;,&#xd;
      &quot;emailId&quot;: null,&#xd;
      &quot;locale&quot;: null,&#xd;
      &quot;type&quot;: &quot;CITIZEN&quot;,&#xd;
      &quot;roles&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;Citizen&quot;,&#xd;
          &quot;code&quot;: &quot;CITIZEN&quot;,&#xd;
          &quot;tenantId&quot;: &quot;pb&quot;&#xd;
        }&#xd;
      ],&#xd;
      &quot;active&quot;: true,&#xd;
      &quot;tenantId&quot;: &quot;pb&quot;,&#xd;
      &quot;permanentCity&quot;: &quot;pb&quot;&#xd;
    }&#xd;
  },&#xd;
  &quot;ProcessInstances&quot;: [&#xd;
    {&#xd;
      &quot;moduleName&quot;: &quot;TL&quot;,&#xd;
      &quot;tenantId&quot;: &quot;pb.amritsar&quot;,&#xd;
      &quot;businessService&quot;: &quot;NewTL&quot;,&#xd;
      &quot;businessId&quot;: &quot;PB-TL-2019-04-17-001741&quot;,&#xd;
      &quot;action&quot;: &quot;INITIATE&quot;,&#xd;
      &quot;comment&quot;: null,&#xd;
      &quot;assignee&quot;: null,&#xd;
      &quot;previousStatus&quot;: null&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8012</stringProp>
          <stringProp name="HTTPSampler.path">/egov-workflow-v2/egov-wf/process/_transition</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Search Process" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search Process" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;RequestInfo&quot;: {&#xd;
    &quot;apiId&quot;: &quot;Rainmaker&quot;,&#xd;
    &quot;action&quot;: &quot;&quot;,&#xd;
    &quot;did&quot;: 1,&#xd;
    &quot;key&quot;: &quot;&quot;,&#xd;
    &quot;msgId&quot;: &quot;20170310130900|en_IN&quot;,&#xd;
    &quot;requesterId&quot;: &quot;&quot;,&#xd;
    &quot;ts&quot;: 1513579888683,&#xd;
    &quot;ver&quot;: &quot;.01&quot;,&#xd;
    &quot;userInfo&quot;: {&#xd;
      &quot;id&quot;: 28451,&#xd;
      &quot;uuid&quot;: &quot;ef5ace2d-a139-45b7-80bf-ce141df8ba5f&quot;,&#xd;
      &quot;userName&quot;: &quot;9408310077&quot;,&#xd;
      &quot;name&quot;: null,&#xd;
      &quot;mobileNumber&quot;: &quot;9408310077&quot;,&#xd;
      &quot;emailId&quot;: null,&#xd;
      &quot;locale&quot;: null,&#xd;
      &quot;type&quot;: &quot;CITIZEN&quot;,&#xd;
      &quot;roles&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;Citizen&quot;,&#xd;
          &quot;code&quot;: &quot;CITIZEN&quot;,&#xd;
          &quot;tenantId&quot;: &quot;pb&quot;&#xd;
        }&#xd;
      ],&#xd;
      &quot;active&quot;: true,&#xd;
      &quot;tenantId&quot;: &quot;pb&quot;,&#xd;
      &quot;permanentCity&quot;: &quot;pb&quot;&#xd;
    }&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8012</stringProp>
          <stringProp name="HTTPSampler.path">/egov-workflow-v2/egov-wf/process/_search?tenantId=pb.amritsar&amp;businessIds=PB-TL-2019-04-17-001741&amp;history=true</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>